In [1]:
# list, tuples

In [2]:
x = [2,436,452,7,7]

In [3]:
y = (32,45,4,75,7)

In [4]:
d = {'name': 'gaurav'}

In [5]:
type(d)

dict

In [6]:
d1 = {'name': 'gaurav', 'salary': 20000}

In [10]:
d1.values()

dict_values(['gaurav', 20000])

In [11]:
d1.keys()

dict_keys(['name', 'salary'])

In [12]:
type(d1.values())

dict_values

In [14]:
list(d1.values())

['gaurav', 20000]

In [15]:
list(d1.keys())

['name', 'salary']

In [16]:
d1.update({'company':'Eduviden'})

In [17]:
d1

{'name': 'gaurav', 'salary': 20000, 'company': 'Eduviden'}

In [22]:
d_ = {'name':['gaurav', 'istiaque'], 'salary':[20000, 30000], 'company':['Eduviden', 'Eduviden']}
d_

{'name': ['gaurav', 'istiaque'],
 'salary': [20000, 30000],
 'company': ['Eduviden', 'Eduviden']}

In [35]:
d_['salary']

[20000, 30000]

In [36]:
d_['salary'][1]

30000

In [20]:
import pandas as pd

In [23]:
pd.DataFrame(d_)

       name  salary   company
0    gaurav   20000  Eduviden
1  istiaque   30000  Eduviden

In [29]:
import json

In [30]:
f = open(r'datasets/simple.json')

In [31]:
data = json.load(f)
data

[{'name': 'Andew', 'age': 12, 'grade': 'A'},
 {'name': 'Bhuvan', 'age': 18, 'grade': 'B'},
 {'name': 'Clinton', 'age': 11, 'grade': 'A'},
 {'name': 'Drake', 'age': 12, 'grade': 'C'},
 {'name': 'Eisha', 'age': 13, 'grade': 'B'},
 {'name': 'Farhan', 'age': 22, 'grade': 'C'},
 {'name': 'Garima', 'age': 11, 'grade': 'A'},
 {'name': 'Himanshu', 'age': 19, 'grade': 'A'},
 {'name': 'Ishaan', 'age': 10, 'grade': 'D'},
 {'name': 'Jason', 'age': 9, 'grade': 'B'}]

In [32]:
type(data)

list

In [33]:
data[0]

{'name': 'Andew', 'age': 12, 'grade': 'A'}

In [34]:
data[0]['name']

'Andew'

In [37]:
pd.DataFrame(data)

       name  age grade
0     Andew   12     A
1    Bhuvan   18     B
2   Clinton   11     A
3     Drake   12     C
4     Eisha   13     B
5    Farhan   22     C
6    Garima   11     A
7  Himanshu   19     A
8    Ishaan   10     D
9     Jason    9     B

In [40]:
f = open(r'datasets/nested.json')
data2 = json.load(f)

In [41]:
data2

[{'student_roll_no': 101,
  'details': {'name': 'Andew', 'age': 12, 'grade': 'A'}},
 {'student_roll_no': 102,
  'details': {'name': 'Bhuvan', 'age': 18, 'grade': 'B'}},
 {'student_roll_no': 103,
  'details': {'name': 'Clinton', 'age': 11, 'grade': 'A'}},
 {'student_roll_no': 104,
  'details': {'name': 'Drake', 'age': 12, 'grade': 'C'}},
 {'student_roll_no': 105,
  'details': {'name': 'Eisha', 'age': 13, 'grade': 'B'}},
 {'student_roll_no': 106,
  'details': {'name': 'Farhan', 'age': 22, 'grade': 'C'}},
 {'student_roll_no': 107,
  'details': {'name': 'Garima', 'age': 11, 'grade': 'A'}},
 {'student_roll_no': 108,
  'details': {'name': 'Himanshu', 'age': 19, 'grade': 'A'}},
 {'student_roll_no': 109,
  'details': {'name': 'Ishaan', 'age': 10, 'grade': 'D'}},
 {'student_roll_no': 110,
  'details': {'name': 'Jason', 'age': 9, 'grade': 'B'}}]

In [42]:
type(data2)

list

In [43]:
data2[0]

{'student_roll_no': 101, 'details': {'name': 'Andew', 'age': 12, 'grade': 'A'}}

In [44]:
data2[0]['student_roll_no']

101

In [45]:
data2[0]['details']

{'name': 'Andew', 'age': 12, 'grade': 'A'}

In [46]:
data2[0]['details']['grade']

'A'